export const questions = [
  {
    id: 1,
    question: "새로운 사람과 대화를 시작할 때, 당신은?",
    options: ["먼저 말을 건다", "상대방이 말을 걸기를 기다린다"],
    type: "E/I",
  },
  {
    id: 2,
    question: "주말에 무엇을 할 때 가장 즐겁나요?",
    options: ["사람들과 어울려 활동한다", "혼자서 시간을 보내는 걸 선호한다"],
    type: "E/I",
  },
  {
    id: 3,
    question: "책을 읽을 때, 당신은?",
    options: [
      "구체적이고 실용적인 내용을 선호한다",
      "상상력이 풍부한 이야기를 좋아한다",
    ],
    type: "S/N",
  },
  {
    id: 4,
    question: "문제를 해결할 때, 당신은?",
    options: ["논리적이고 체계적으로 접근한다", "직관적으로 접근한다"],
    type: "T/F",
  },
  {
    id: 5,
    question: "친구가 실수했을 때, 당신은?",
    options: ["그냥 넘어간다", "그 이유를 물어본다"],
    type: "T/F",
  },
  {
    id: 6,
    question: "여행을 떠날 때, 당신은?",
    options: ["미리 계획을 세운다", "현장에서 즉흥적으로 결정한다"],
    type: "J/P",
  },
  {
    id: 7,
    question: "회의 중 아이디어가 떠오를 때, 당신은?",
    options: ["바로 말을 한다", "조용히 생각을 정리한 후 말한다"],
    type: "E/I",
  },
  {
    id: 8,
    question: "카페에서 앉을 자리를 고를 때, 당신은?",
    options: ["창가 자리를 선호한다", "구석자리나 조용한 자리를 선호한다"],
    type: "S/N",
  },
  {
    id: 9,
    question: "여러 사람이 있는 자리에서, 당신은?",
    options: ["적극적으로 대화에 참여한다", "조용히 주변을 관찰한다"],
    type: "E/I",
  },
  {
    id: 10,
    question: "어떤 것을 할 때, 당신은?",
    options: ["완벽히 계획하고 실천한다", "그때그때 느낌대로 한다"],
    type: "J/P",
  },
  {
    id: 11,
    question: "새로운 기술을 배울 때, 당신은?",
    options: ["일단 시작해본다", "차근차근 계획을 세운 후 시작한다"],
    type: "J/P",
  },
  {
    id: 12,
    question: "스트레스를 받았을 때, 당신은?",
    options: ["혼자 시간을 보내며 풀려 한다", "사람들과 대화하며 풀려 한다"],
    type: "E/I",
  },
  {
    id: 13,
    question: "친구와 함께할 계획을 세울 때, 당신은?",
    options: [
      "미리 구체적으로 계획을 세운다",
      "대충 아이디어만 내고 자유롭게 한다",
    ],
    type: "J/P",
  },
  {
    id: 14,
    question: "어떤 일을 시작할 때, 당신은?",
    options: ["세부적인 계획부터 세운다", "큰 그림을 보고 시작한다"],
    type: "S/N",
  },
  {
    id: 15,
    question: "새로운 사람과 관계를 맺을 때, 당신은?",
    options: ["쉽게 마음을 연다", "시간을 두고 천천히 마음을 연다"],
    type: "E/I",
  },
  {
    id: 16,
    question: "문제를 해결할 때, 당신은?",
    options: ["사실과 데이터를 우선시한다", "감정과 사람을 고려한다"],
    type: "T/F",
  },
  {
    id: 17,
    question: "과제를 할 때, 당신은?",
    options: ["끝까지 결과물을 완성해야 한다", "과정에서 배우는 게 중요하다"],
    type: "J/P",
  },
  {
    id: 18,
    question: "친구가 생일 선물을 줬을 때, 당신은?",
    options: ["무슨 선물인지 묻고 고마워한다", "깜짝 선물에 감동한다"],
    type: "T/F",
  },
  {
    id: 19,
    question: "공공장소에서 혼자 있을 때, 당신은?",
    options: [
      "이상할 때까지 혼자 있는 걸 즐긴다",
      "다른 사람들과 자연스럽게 대화하고 싶다",
    ],
    type: "E/I",
  },
  {
    id: 20,
    question: "일이 많을 때, 당신은?",
    options: [
      "체계적으로 우선순위를 정하고 한다",
      "각각의 일에 대해서 적당히 대응한다",
    ],
    type: "J/P",
  },
];
